
<body>
    <div class="main">
        <div class="header">
            <div class="headert_text_resize">
                <div class="headert_text">
                    <h2>Где изучать программирование? </h2>
                    <p><span> Некоторые, желая сэкономить время и быстрее освоить специальность, решают пройти специальные курсы и не идти в университет. Хотя этот вариант действительно экономит время, у него есть существенный недостаток. </span></p>
                    <p>Специалисты, не окончившие вуз не будут цениться на рынке труда. Сейчас конкуренция у программистов очень большая. </p>
                </div>
        </div>
        <div class="body">
            <div class="body_resize">
                <div class="left">
                    <div class="resize_bg">
                       <h1>Что надо понимать?</h1>
                        <p><b>Какие же знания должен иметь будущий специалист в сфере IT? Какие навыки надо развивать? На что надо уделить большее внимание и силы?</b> </p>
                        <h2>Математику</h2>
                        <p>Нет, обучение IT не будет похоже на уроки алгебры в школе. Однако программист должен как минимум знать основные формулы и уметь выполнять простые операции. В то же время «погружение» в математику зависит от того, в каком IT-направлении хочет развиваться человек. Например, для написания сложных алгоритмов понадобится более глубокое освоение предмета. В будущем оно пригодится для «сложных» IT-профессий, среди которых аналитик Big Data или специалист по машинному обучению. </p>
                        <p>&nbsp;</p>
                        <h2>Логику</h2>
                        <p>Недостаточно хорошо понимать математику, важно уметь мыслить логически, потому что все программы построены на логике. Если ее нет, то и код не будет работать. Код состоит из последовательных логических операций, которые, в свою очередь, запускают последующие. Без базового знания логики стать программистом не получится.</p>
                        <p>&nbsp;</p>
                        <h2>Алгоритмику и структуры данных</h2>
                        <p>Без их понимания не удастся решить ни одну задачу. Более того, эти знания требуют в первую очередь при приеме на работу. Алгоритмика учит достигать целей, поэтапно выстраивая план действий. Без этого навыка программист не запустит ни одну программу. Структуры данных включают в себя связанные списки, массивы, стеки и др. Без этих инструментов невозможно разработать ни одно работающее приложение.</p>
                        <p>&nbsp;</p>
                         <h2>Базовые инструменты разработки</h2>
                        <p>Без него не обойтись! Потому что все почти языки программирования используют английские слова. Знание языка поможет легче разобраться в коде, использовать библиотеки, проходить продвинутые курсы и общаться с коллегами из других стран. Но не только, чтобы дружить: зная язык, всегда можно найти ответы у более опытных специалистов.</p>
                        <p>&nbsp;</p>
                        <p>&nbsp;</p>
                    </div>
                </div>
            </div>
    </div>
        <div class="FBG">
            <div class="FBG_resize">
                <div class="blok">
                    <h2>Про <span>сайт</span></h2>
                    <p>Этот сайт рассказывает о профессии программиста. Показывает какие виды программистов существуют, что требуется знать чтобы стать программистом икаковы перспективы данной профессии.
                    </p>
                </div>
                <div class="blok">
                    <h2>O создателе <span>сайта</span></h2>
                    <p>Я участник проекта "Код будущего"<br />
                        Учусть в техникуме на программиста.<br />
                        <br />
                        Telephone : +7 9012345678<br />
                    </p>
                </div>
            </div>
        </div>
</body>

<style>
    @charset "utf-8";
body{
        margin:auto;
        display: flex;
        flex-direction: column;
        align-items: center;
        min-height: 100%;
        padding: 5vmin;
        box-sizing: border-box;
        background: antiquewhite;
    }
</style>