
<body>
    <div class="main">
        <div class="header">
            <div class="header_resize">
            <div class="headert_text_resize">
                <div class="headert_text">
                    <h2>Чего же больше: плюсов или минусов? </h2>
                    <p><span>Как и в любой профессии, в программировании достаточно плюсов и минусов</span></p>
                    <p>Каждый будет решать сам, надо ли ему это или нет.</p>
                </div>
                <div class="clr"></div>
            </div>
        </div>
        <div class="body">
            <div class="body_resize">
                <div class="left4">
                    <div class="resize_bg">
                        <h1>Плюсы работы</h1>
                        <h2>Высокие зарплаты</h2>
                        <p>«Требуется программист, зарплата от 100 тысяч рублей» — для большей части России такое объявление является настоящей вакансией мечты. Для айтишника это рядовое предложение о работе с обычной для отрасли зарплатой.</p>
                        <p>Сфера ИТ действительно является одним из лидеров по уровню окладов на российском рынке труда и уступает в этом отношении только добывающей отрасли, находясь на одном уровне с нефтегазовым сектором.</p>
                        <p>Зато уровень конкуренции в ИТ примерно в два раза ниже, чем в сфере добычи сырья. Более того, в отличие от добывающих компаний, ИТ-сектор показывал положительную динамику спроса на специалистов даже в кризис, оставаясь главным драйвером рынка в Москве и Санкт-Петербурге.</p>
                        <h2>Возможности для роста</h2>
                        <p>Счастье, как известно, не в деньгах, и наши соискатели это подтверждают. Наиболее важным плюсом ИТ-отрасли они считают перспективность, а не высокие оклады.</p>
                        <p>Соискатели склонны видеть в информационных технологиях большое поле возможностей, которое вряд ли зарастет сорняками в ближайшие пару десятков лет. Причем перспективность отрасли в целом оказывается для них даже важнее, чем конкретные возможности развития собственной карьеры.</p>
                        <p>Скорее всего, люди ценят свободу, которую предоставляет отрасль: здесь можно выбрать близкую по духу компанию, будь то международная корпорация или небольшой стартап, и не волноваться относительно своего профессионального роста.</p>
                        <h2>Возможность работать удаленно</h2>
                        <p>Среди экспертов бытует мнение, что за удаленной работой будущее, а труд в офисе скоро станет таким же анахронизмом, как заводы и рабочие кварталы в больших городах.</p>
                        <p>Для работников ИТ-сферы удаленка — никакое не будущее. Российский айтишник уже сегодня любит работать из дома за несколько тысяч километров от головного офиса, не обременяя себя переездом, пробками или давкой в метро, а работодателя — созданием подходящего для себя рабочего пространства.</p>
                        <h1>Минусы</h1>
                        <h2>Низкий старт</h2>
                        <p>Высокие оклады частично компенсируются тем, что начинать карьеру в сфере ИТ не так-то просто. Начинающий разработчик мобильных приложений для iOS в России получает меньше среднестатистического курьера, а оклад новичка-программиста на Java в Москве сравним с зарплатой столичного официанта.</p>
                        <p>При переходе на следующую карьерную ступень оклад сотрудника в ИТ поднимается примерно вдвое.</p>
                        <h2>Высокая конкуренция в будущем</h2>
                        <p>В том, что рано или поздно программисты вытеснят добрую половину сегодняшних профессий, похоже, уже никто не сомневается. Вот только что будет с самими программистами, тоже неясно.</p>
                        <p>Стоит учесть и еще один фактор — в отличие от представителей других профессиональных областей, далеко не все айтишники ищут вакансии на работных сайтах, предпочитая сарафанное радио или профессиональные сообщества. Поэтому в реальности уровень конкуренции в сфере еще выше.</p>
                        <h2>Приходится постоянно учиться</h2>
                        <p>Не стоит думать, что, устроившись программистом удаленно, вы сможете больше времени тратить по своему усмотрению — скорее всего, изрядную часть жизни вам придется посвятить учебе. Как говорят корифеи: «Первая вещь, которую должен выучить программист, — это то, что его обучение никогда не закончится».</p>
                        <h2>Сидячая работа</h2>
                        <p>Каким бы комфортным ни было рабочее место программиста, от необходимости пялиться в монитор большую часть жизни оно не избавит.</p>
                        <p>Многие работодатели в ИТ компенсируют сотрудникам необходимость вести сидячий образ жизни, предоставляя корпоративные скидки на занятия в спортзале. А вот компенсировать падение зрения к 40 годам, к сожалению, нечем.</p>
                        <p>&nbsp;</p>
                        <div class="smail">
                            <svg width="200" height="200" viewBox="0 0 200 200">
                                <circle cx="100" cy="100" r="100" fill="yellow" />
                                <circle cx="100" cy="100" r="50" fill="black" />
                                <circle cx="100" cy="80" r="60" fill="yellow" />
                                <circle cx="60" cy="80" r="20" fill="black" />
                                <circle cx="140" cy="80" r="20" fill="black" />
                            </svg>
                        </div>
                        <p>&nbsp;</p>
                        <h2>&nbsp;</h2>
                    </div>
                </div>
                <div class="clr"></div>
            </div>
        </div>
        <div class="FBG">
            <div class="FBG_resize">
                <div class="blok">
                    <h2>Про <span>сайт</span></h2>
                    <p>Этот сайт рассказывает о профессии программиста. Показывает какие виды программистов существуют, что требуется знать чтобы стать программистом икаковы перспективы данной профессии.
                    </p>
                </div>
                <div class="blok">
                    <h2>O создателе <span>сайта</span></h2>
                    <p>Я участник проекта "Код будущего"<br />
                        Учусть в техникуме на программиста.<br />
                        <br />
                        Telephone : +7 9012345678<br />
                    </p>
                </div>
            </div>
        </div>
    </div>
</body>

<style>
    @charset "utf-8";
body{
        margin:auto;
        display: flex;
        flex-direction: column;
        align-items: center;
        min-height: 100%;
        padding: 5vmin;
        box-sizing: border-box;
        background: antiquewhite;
    }
</style>