
<body>
    <div class="main">
        <div class="header">
            <div class="header_resize">
                <div class="clr"></div>
            </div>
            <div class="headert_text_resize">
                <div class="headert_text">
                    <h2>Перспективы специальности </h2>
                    <p><span>Раньше все хотели стать космонавтами, а теперь — программистами. Статистика подтверждает: сфера информационных технологий стала самой привлекательной для трудоустройства на российском рынке труда. Именно в ИТ стремится перейти больше всего представителей других профессиональных областей — там хотел бы работать каждый пятый российский соискатель..</span></p>
                </div>
                <div class="clr"></div>
            </div>
        </div>
        <div class="body">
            <div class="body_resize">
                <div class="left">
                    <div class="resize_bg">
                        <h2>Где <span>работать?</span></h2>
                        <p>— Компании-разработчики</p>
                        <p>— IT-отделы и отделы digital-маркетинга организаций</p>
                        <p>— Системные интеграторы</p>
                        <p>&nbsp;</p>
                        <h2>Карьерные <span>возможности</span></h2>
                        <div class="clr"></div>
                        <p>Сами программисты оценивают длительность каждой ступени следующим образом:</p>
                        <p>— Первые полгода-полтора года реального опыта вы junior</p>
                        <p>— При активном обучении следующие 1-3 года работы вы middle</p>
                        <p>— А программист с опытом работы 4-6 лет – это senior</p>
                        <p>Но, конечно, стоит помнить, что границы условны, и более активный и любознательный разработчик сможет освоить все навыки senior-developer за 3 года. Кроме глубокой специализации в программировании, программисту доступно движение в смежные области внутри IT-компании – дизайн, маркетинг, аналитику, менеджмент.</p>
                        <p>Программист может стать архитектором программного обеспечения, девопс-инженером, менеджером IT-проектов, если ему это интересно и у него есть нужные компетенции. Например, чтобы работать менеджером, ему потребуется коммуникабельность, инициативность, умение формировать команду и контролировать бизнес-процессы.</p>
                        <h2>&nbsp;</h2>
                        <h2>Оплата <span>труда</span></h2>
                        <p>Зарплата программиста напрямую зависит от специализации и квалификации. Наименее оплачиваемые должности – это junior-разработчики, которые только учатся. А наиболее оплачиваемые на рынке труда – архитекторы ПО и системные инженеры, на которых лежит ответственность за продукт или проект в целом. Поэтому диапазон зарплат программистов может быть очень широким: 30 000 – 500 000 рублей</p>
                        <p>&nbsp;</p>
                         <h2>Перспективы <span>профессии</span></h2>
                        <p>Сейчас отрасль IT в целом и программирование в частности находятся на пике востребованности. Компании конкурируют за квалифицированных специалистов. В перспективе ближайших 5 лет программистов ждет благополучная жизнь и высокие зарплаты, потому что молодых кадров станет немного меньше.</p>
                        <p>&nbsp;</p>
                         <h2>Но рынок IT ждет <span>несколько опасностей:</span></h2>
                        <p>Во-первых, обучение программированию сейчас начинается уже практически с детского сада. Самые известные обучающие языки — это Scratch от MIT и Blockly от Google. А если им владеет почти каждый, то и ценность работы снижается.</p>
                        <p>Во-вторых, IT-образование сейчас дает почти каждый колледж и вуз. После дефицита рынок может "насытиться" профессиональными программистами, и их зарплаты упадут.</p>
                        <p>В-третьих, есть страны, в частности Индия, где IT-образование развивается еще быстрее. И в определенный момент услуги программирования насытят мировой рынок. Будущему программисту стоит помнить об этих рисках. Но, как и в любой профессии, настоящий специалист, который любит свое дело и профессионально развивается, в любые времена будет востребован.</p>
                        <p>&nbsp;</p>
                        <h2>&nbsp;</h2>
                    </div>
                </div>
                <div class="clr"></div>
            </div>
        </div>
        <div class="FBG">
            <div class="FBG_resize">
                <div class="blok">
                    <h2>Про <span>сайт</span></h2>
                    <p>Этот сайт рассказывает о профессии программиста. Показывает какие виды программистов существуют, что требуется знать чтобы стать программистом икаковы перспективы данной профессии.
                    </p>
                </div>
                <div class="blok">
                    <h2>O создателе <span>сайта</span></h2>
                    <p>Я участник проекта "Код будущего"<br />
                        Учусть в техникуме на программиста.<br />
                        <br />
                        Telephone : +7 9012345678<br />
                    </p>
                </div>
            </div>
        </div>
    </div>
</body>
<style>
    @charset "utf-8";
body{
        margin:auto;
        display: flex;
        flex-direction: column;
        align-items: center;
        min-height: 100%;
        padding: 5vmin;
        box-sizing: border-box;
        background: antiquewhite;
    }
</style>