<body>
    <div class="main">
        <div class="header">
            <div class="headert_text_resize">
                <div class="headert_text">
                    <h2>Кто такой программист?</h2>
                    <p><span>Это человек, который создаёт компьютерные программы, сайты, веб-сервисы и мобильные приложения с помощью языков программирования. Программист работает в команде с другими программистами и дизайнерами, чтобы спроектировать каждую часть приложения или программного обеспечения, а затем определить, как они будут работать вместе.</span></p>
                </div>
        </div>
        <div class="body">
            <div class="body_resize">
                <div class="left">
                    <div class="resize_bg">
                       <h1>Виды программистов</h1>
                        <h2>Frontend-разработчик</h2>
                        <p>Фронтенд-разработчик — это одна из самых востребованных профессий программистов. Они отвечают за интерфейс сайтов и веб-приложений — то, что доступно и открыто пользователям. Меню, анимации, кнопки, формы на сайтах — это работа фронтендера.<br /></p>
                        <h3>Что делать?</h3>
                        <p>—Получать от дизайнера макет сайта или его части в виде шаблона или статичной картинки. Сделать так, чтобы браузер пользователя отображал сайт идентично.</p>
                        <p>—Адаптировать интерфейс для отображения на экранах с разным разрешением, смартфонов и планшетов.</p>
                        <p>—Писать код для интерактивных элементов: кнопок, форм, тулбаров, калькуляторов расчёта стоимости, форм обратной связи.</p>
                        <p>—Самостоятельно продумывать дизайн сервисов при необходимости. Делать его не только красивым, но и удобным для пользователей.</p>
                        <p>—Тестировать веб-сервисы на ошибки.</p>
                        <h2>Backend-разработчик</h2>
                        <p>Фронтендеры отвечают за внешний вид приложения для пользователей, а бэкендеры — за его серверную часть, то есть за то, что обеспечивает работу сервиса — взаимодействие с базами данных, обработку информации и вычисления. Сейчас, учитывая обилие веб-сервисов, это один из самых популярных видов программистов.<br /></p>
                        <h3>Что делать?</h3>
                        <p>—Писать и тестировать код для обработки запросов в браузерах, мобильных клиентах, любых внешних системах, которые взаимодействуют с текущим сервисом.</p>
                        <p>—Настраивать взаимодействие с базами данных: MySQL, PostgreSQL, MongoDB, Oracle, Tarantool, ClickHouse.</p>
                        <p>—Обеспечивать защиту веб-сервисов от атак.</p>
                        <p>—Разрабатывать масштабируемые и устойчивые к нагрузкам сервисы.</p>
                        <h2>Fullstack-разработчик</h2>
                        <p>Фулстек-разработчик занимается и фронтедом, и бэкендом. Он разрабатывает весь сервис в комплексе, отвечает и за сервисную, и за клиентскую часть.<br /></p>
                        <h3>Что делать?</h3>
                        <p>—Полностью разрабатывать функционал приложения.</p>
                        <p>—Работать с базами данных.</p>
                        <p>—Прорабатывать внешний вид сайта.</p>
                        <p>—Адаптировать интерфейс для отображения на экранах с разным разрешением, смартфонах и планшетах.</p>
                        <p>—Тестировать веб-сервисы на ошибки.</p>
                        <p>—Самостоятельно продумывать дизайн сервисов при необходимости.</p>
                        <p>—Обеспечивать защиту веб-сервисов от атак.</p>
                        <h2>Разработчик мобильных приложений</h2>
                        <p>Чаще всего они делятся на две группы: iOS- и Android-разработчики, потому что у каждой системы своя специфика. Есть инструменты, которые позволяют писать приложения сразу для всех платформ — тех, кто ими владеют, называют мультиплатформенными разработчиками. Мобильные разработчики пишут приложения для умных устройств, смарт-часов и других гаджетов.<br /></p>
                        <h3>Что делать?</h3>
                        <p>—Писать код приложений для мобильных устройств.</p>
                        <p>—Разрабатывать пользовательских интерфейс для этих приложений — то, с чем будут взаимодействовать пользователи.</p>
                        <p>—При необходимости корректировать или даже придумывать дизайн для интерфейса вместе с дизайнерами.</p>
                        <p>—Обеспечивать связь приложения и базы данных.</p>
                        <p>—Тестировать и оптимизировать приложения вместе с командой тестировщиков.</p>
                         <h2>Java-разработчик</h2>
                        <p>Предыдущие профессии были связаны в основном с задачами, которые решают программисты. Java-разработчик работает с конкретной технологией и пишет именно на языке Java. Он может быть бэкендером, разрабатывать приложения на Android или компьютерные программы, но всегда делает это именно на Java, используя другие языки как вспомогательный инструмент. Это довольно востребованный вид разработчиков, так как Java все ещё остаётся одним из самых популярных языков программирования.<br /></p>
                        <h3>Что делать?</h3>
                        <p>—Писать на Java: программы для компьютеров, приложения для мобильных устройств, бэкенд для веб-сервисов.</p>
                        <p>—Тестировать написанный код и исправлять в нём ошибки.</p>
                        <p>—Работать с базами данных.</p>
                        <p>—Обеспечивать безопасность написанного кода.</p>
                        <p>—Делать приложения устойчивыми к нагрузкам.</p>
                        <h2>Разработчик игр</h2>
                        <p>Компьютерная игра — это та же программа. Чтобы она появилась, нужны программисты, которых называют разработчиками игр. Важно не путать разработчика с другими специалистами: сценаристом, дизайнером и геймдизайнером<br /></p>
                        <h3>Что делать?</h3>
                        <p>—Писать код по заданиям от других специалистов. </p>
                        <p>—Оптимизировать код так, чтобы он хорошо работал не только на мощном компьютере.</p>
                        <p>—Адаптировать код для других платформ — например, чтобы игра одинаково хорошо работала на iOS, Android, PlayStation, Xbox, Nintendo.</p>
                        <p>—Тестировать код и исправлять ошибки.</p>
                        <h2>QA-тестировщик</h2>
                        <p>Программисты могут тестировать код, однако основная их работа — всё-таки его писать. Поэтому существуют отдельные специалисты — тестировщики. Их ещё называют QA-инженерами (от англ. quality assurance, обеспечение качества). Тестировщики проверяют работоспособность написанного ПО разными методами как вручную, так и с помощью специальных программ. И в случае обнаружения ошибок отправляют код программистам на доработку.<br /></p>
                        <h3>Что делать?</h3>
                        <p>—Писать тест-кейсы — описание последовательности действий, которые нужно провести для проверки работоспособности программы.</p>
                        <p>—Проходить эти тест-кейсы, моделировать реальное использование сервиса и записывать результаты.</p>
                        <p>—Отправлять программистам баг-репорты — подробные описания возникших проблем.</p>
                        <p>—Разрабатывать и поддерживать в рабочем состоянии автоматизированные тесты, которые сами принимают код и отправляют разработчикам сообщения об ошибках.</p>
                        <p>&nbsp;</p>
                        <h2>&nbsp;</h2>
                    </div>
                </div>
                </div>
        </div>
        <div class="FBG">
            <div class="FBG_resize">
                <div class="blok">
                    <h2>Про <span>сайт</span></h2>
                    <p>Этот сайт рассказывает о профессии программиста. Показывает какие виды программистов существуют, что требуется знать чтобы стать программистом икаковы перспективы данной профессии.
                    </p>
                </div>
                <div class="blok">
                    <h2>O создателе <span>сайта</span></h2>
                    <p>Я участник проекта "Код будущего"<br />
                        Учусть в техникуме на программиста.<br />
                        <br />
                        Telephone : +7 9012345678<br />
                    </p>
                </div>
                <div class="clr"></div>
            </div>
        </div>
        <div class="footer">
            <div class="footer_resize">
                <p class="rf">Этот сайт был создан для проекта "код будущего"!</p>
            </div>
        </div>
</body>
<style>
    @charset "utf-8";
body{
        margin:auto;
        display: flex;
        flex-direction: column;
        align-items: center;
        min-height: 100%;
        padding: 5vmin;
        box-sizing: border-box;
        background: antiquewhite;
    }
</style>